app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-11-22 14:41:31.678518"], ["updated_at", "2023-11-22 14:41:31.678518"]]